# 2.5.5 位运算符

#（二进制转换为10进制，依次乘以2的位数的次方，再相加: (** 128 64 32 16  8 4 2 1）
a=12                            # 12 = 0000 1100
b=6                             # 6  = 0000 0110
c=0
print("a=",a, " b=",b," c=",c)

#按位与运算,2个都1才为1，否则为0
c = a & b                       # 0000 0100 =4
print("设：c=a&b，则c的值为",c)

#按位或运算，只要有一个为1则为1，否则为0，
c=a|b
print("设：c=a|b，则c的值为",c)    # 0000 1110 =14   8+4+2+0

#按位异或运算,2个不一样则为1，否则为0
c=a^b
print("设：c=a^b，则c的值为",c)    # 0000 1010 =10   8+0+2+0

#按位取反运算，0变成1，1变成0
c=~a
print("设：c=~a，则c的值为",c)     #1000 1101  (计算机中,二进制首位表示正负，1为负 0为正)

#左移动运算
c=a<<2
print("设：c=a<<2,则c的值为",c)    #0011 0000  =48

#左移动运算
c=a>>2
print("设：c=a>>2,则c的值为",c)    #0000 0011  =3


